org/text-editors.org
#+setupfile:./hugo_setup.org
#+hugo_slug: text-editors
#+TITLE: Text Editors

Text editors control the way you interface with written content. For programmers, this is the vast majority of the content they create, develop, and perhaps consume.

* Work
[[https://github.com/xi-editor/xi-editor][Xi]] is a flexible editor with a modular approach to construction; if you implement Xi's protocol, you can use any user interface that calls back to Xi on the backend.
https://github.com/LightTable/LightTable
https://github.com/hundredrabbits/Left a writing tool without the distractions
https://github.com/yi-editor/yi The Yi editor is a collection of packages for using haskell to create a text editor.

* Etc
https://www.techradar.com/best/best-text-editors
https://github.com/LightTable/LightTable -- incredibly powerful editor
https://github.com/tree-sitter/tree-sitter parsing tool system

https://metaredux.com/posts/2018/11/09/ciders-orchard-the-heart.html cidet
interface, very cool livecoding environment

https://github.com/pitr/config_files mostly vim config
* roam
this is a new editor point from roam or something
i am making a new note.:
