content/posts/text-editors.md
+++
title = "Text Editors"
author = ["Jacob Chvatal"]
lastmod = 2020-08-01T22:55:43-07:00
slug = "text-editors"
draft = false
+++

Text editors control the way you interface with written content. For programmers, this is the vast majority of the content they create, develop, and perhaps consume.


## Work {#work}

[Xi](https://github.com/xi-editor/xi-editor) is a flexible editor with a modular approach to construction; if you implement Xi's protocol, you can use any user interface that calls back to Xi on the backend.
<https://github.com/LightTable/LightTable>
<https://github.com/hundredrabbits/Left> a writing tool without the distractions
<https://github.com/yi-editor/yi> The Yi editor is a collection of packages for using haskell to create a text editor.


## Etc {#etc}

<https://www.techradar.com/best/best-text-editors>
<https://github.com/LightTable/LightTable> -- incredibly powerful editor
<https://github.com/tree-sitter/tree-sitter> parsing tool system

<https://metaredux.com/posts/2018/11/09/ciders-orchard-the-heart.html> cidet
interface, very cool livecoding environment

<https://github.com/pitr/config%5Ffiles> mostly vim config


## roam {#roam}

this is a new editor point from roam or something
i am making a new note.:
